# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# brew all teh things
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "withgraphite/tap"
tap "lettertwo/brew"
tap "jesseduffield/lazygit"

# CLI Tools
brew "zsh"
brew "fzf"
brew "git"
brew "sheldon"
brew "coreutils"
brew "tree"
brew "readline"
brew "wget"
brew "tldr"
brew "trash"
brew "lnav"
brew "ripgrep" # BurntSushi/ripgrep
brew "fd" # sharkdp/fd, replacement for find
brew "bat" # sharkdp/bat, replacement for cat
brew "exa" # ogham/exa, replacement for ls
brew "git-delta" # dandavison/delta, replacement for diff
brew "dust" # bootandy/dust, replacement for du
brew "duf" # muesli/duf, replacement for df
brew "bottom" # ClementTsang/bottom, replacement for top
brew "broot" # canop/broot, replacement for tree
brew "zoxide" # ajeetdsouza/zoxide, smarter cd
brew "nnn-nerdfont", args: ["HEAD"] # tapped to enable nerdfont icons

# misc. dev tooling
brew "watchman"
brew "graphviz"
brew "hyperfine"

# lua
brew "lua-language-server"

# neovim dependencies
# See https://github.com/neovim/neovim/wiki/Building-Neovim#macos--homebrew
brew "ninja"
brew "libtool"
brew "automake"
brew "cmake"
brew "pkg-config"
brew "gettext"
brew "curl"

# git
brew "gh"
brew "git-absorb"
brew "git-lfs"
brew "graphite"
brew "lazygit", args: ["HEAD"]

# node
brew "node"
brew "fnm" # fast node version manager

# python
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"

# Quick Look plugins
cask "syntax-highlight" # https://github.com/sbarex/SourceCodeSyntaxHighlight

# QMK
cask "qmk-toolbox" # https://github.com/qmk/qmk_toolbox
