# Minimal brewfile for remote dev environment
#
# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# CLI Tools
brew "fzf"
brew "sheldon"
brew "ripgrep" # BurntSushi/ripgrep
brew "fd" # sharkdp/fd, replacement for find
brew "bat" # sharkdp/bat, replacement for cat
brew "exa" # ogham/exa, replacement for ls
brew "git-delta" # dandavison/delta, replacement for diff
brew "dust" # bootandy/dust, replacement for du
brew "duf" # muesli/duf, replacement for df
brew "bottom" # ClementTsang/bottom, replacement for top
brew "zoxide" # ajeetdsouza/zoxide, smarter cd

# misc. dev tooling
brew "watchman"
brew "graphviz"
brew "hyperfine"

# neovim dependencies
# See https://github.com/neovim/neovim/wiki/Building-Neovim#ubuntu--debian
brew "ninja"
brew "gettext"
brew "cmake"
brew "unzip"
brew "curl"

# git
brew "git-absorb"
brew "git-lfs"
brew "lazygit", args: ["HEAD"]

# node
brew "node"
brew "fnm" # fast node version manager

# python
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
